[M_FakeGeekGuy MissionDefinition]
MissionDescription="Lilith is afraid that Mister Torgue -- with his huge muscles and rugged good looks -- is actually faking interest in Bunkers & Badasses just to look trendy. Tina has come up with a way to find out Torgue's true nerdiness for sure: she's scattered several geeky questions across her campaign. If you can find them, the group will determine whether Torgue is faking his geekiness or not."
TurnInDescription="Inclusiveness, ho!"

[M_FakeGeekGuy:TakeScroll MissionObjectiveDefinition]
ProgressMessage="Take scroll"
